const questions = [
  {
      question: "Что такое @property?",
      answer: "Декоратор для создания свойства класса.",
      options: [
          "Метод для присваивания значений свойствам объекта.",
          "Функция для установки прав доступа к свойствам класса.",
          "Декоратор для создания свойства класса.",
          "Аннотация для определения типов свойств.",
          "Специальный класс для работы с атрибутами."
          
      ]
  },
  {
      question: "Каким образом можно запустить код на Python параллельно?",
      answer: "Применение библиотеки multiprocessing.",
      options: [
        "Применение библиотеки multiprocessing.",
          "Использование библиотеки threading.",
          "Использование декоратора @parallel.",
          "Запуск через командную строку с флагом -p.",
          "Использование библиотеки concurrent."
          
      ]
  },
  {
      question: "Как работать с stdlib?",
      answer: "Использование стандартной библиотеки Python.",
      options: [
          "Подключение внешних библиотек с префиксом stdlib.",
          "Установка стандартной библиотеки через pip.",
          "Использование стандартной библиотеки Python.",
          "Использование стандартной библиотеки C++.",
          "Загрузка stdlib как модуля."
          
      ]
  },
  {
      question: "Какие задачи решали с помощью метаклассов?",
      answer: "Генерация классов динамически.",
      options: [
          "Управление доступом к методам класса.",
          "Определение статических методов класса.",
          "Работа с экземплярами классов.",
          "Использование декораторов для классов.",
          "Генерация классов динамически."
      ]
  },
  {
      question: "Что такое дескрипторы?",
      answer: "Объекты, предоставляющие управление доступом к атрибутам.",
      options: [
          "Классы, предназначенные для создания GUI.",
          "Объекты, предоставляющие управление доступом к атрибутам.",
          "Методы для описания структуры данных.",
          "Декораторы для функций.",
          "Специальные функции для работы с файлами."
          
      ]
  },
  {
      question: "Какие технологические особенности реализации распределенных систем?",
      answer: "Асинхронные вызовы и обработка сообщений.",
      options: [
          "Использование синхронных вызовов.",
          "Применение только одного протокола связи.",
          "Асинхронные вызовы и обработка сообщений.",
          "Работа с большим объемом данных в одном центре.",
          "Распределенная база данных.",
          
      ]
  },
  {
      question: "Какие есть низкоуровневые особенности языков и фреймворков?",
      answer: "Явная управляемая память и указатели.",
      options: [
        "Явная управляемая память и указатели.",
          "Виртуальная машина и интерпретация кода.",
          "Абстракция от железа и высокий уровень абстракции.",
          "Только статическая типизация.",
          "Использование только JIT-компиляции."
          
      ]
  },
  {
      question: "Способы и методы управления памятью.",
      answer: "Автоматическое управление памятью и сборка мусора.",
      options: [
          "Использование только стека.",
          "Ручное выделение и освобождение памяти.",
          "Использование только пула памяти.",
          "Статическое распределение памяти при компиляции.",
          "Автоматическое управление памятью и сборка мусора."
      ]
  },
];